export interface Game {
  id: string;
  name: string;
  description: string;
}

export const GAMES_DATA: Game[] = [
  {
    id: "1",
    name: "කනා මුට්ටි බිඳීම",
    description:
      "ඇස් බැඳගෙන මුට්ටියක් බිඳීමට උත්සාහ කරන ක්‍රීඩාවකි. පරම්පරා සිට සිදු වෙමින් එන සාම්ප්‍රදායික ක්‍රීඩාවකි.",
  },
  {
    id: "2",
    name: "කඹ ඇදීම",
    description:
      "කණ්ඩායම් දෙකක් කඹයක දෙපැත්තෙන් ඇදීමේ ක්‍රීඩාවකි. දෙහස් අවුරුද්දේදී පවුල් සියල්ල එක්ව සෙල්ලම් කරන සෑම විටම සිදු කරයි.",
  },
  {
    id: "3",
    name: "රබන් ගැසීම",
    description:
      "විශේෂයෙන් කාන්තාවන් විසින් සිදු කරන සාම්ප්‍රදායික රබන් වැයීමකි.හැම දිනම ප්‍රිය ක්‍රීඩාවකි.",
  },
  {
    id: "4",
    name: "ලිස්සන ගසේ යෑම",
    description:
      "ලිස්සනසුලු ගසක් මත නැඟ ඉහළ ඇති තෑග්ගක් ලබා ගැනීමට උත්සාහ කරන ක්‍රීඩාවකි. සුවිසල්බිම් පිටින්න ප්‍රිය ක්‍රීඩාවකි.",
  },
  {
    id: "5",
    name: "එල්ලුම්",
    description:
      "පුතුන් කර කුඩා අයට එල්ලුම් සිතවන ක්‍රීඩාවකි. අනෙක්වරු එල්ලුම් අනුමාන කිරීමට උත්සාහ කරයි.",
  },
  {
    id: "6",
    name: "කුණු බැස්සා",
    description:
      "ගිණි වළිගෝ එහි ඉඳ එක පිට කුණු බැස්සා කුණු එකතු කිරීම සිදු කරයි. අවුරුදු ක්‍රීඩාවකි.",
  },
  {
    id: "7",
    name: "සකසු",
    description:
      "ගිනි සිටිකරගෙන එක අයක් බිම සිටින අනෙක්වරුන් දිසා ගිනි ඇවිතිය හැක. අමතු බිම සිටින කුඩා ළමුන් ඉතා සතුටින්න කරයි.",
  },
  {
    id: "8",
    name: "පෙවිසි",
    description:
      "කුඩා වනිතා එක්ව පෙවිසි ගත්ව එකිනෙකා ගිනි දෝර කරයි. අවුරුදු බිම් පිටින් පරිවර්තන කාන්තා අතර ඉතා ජනප්‍රිය සම්ප්‍රදායක ක්‍රීඩාවකි.",
  },
];
