export interface Nakath {
  id: string;
  event: string;
  time: string;
  color: string;
  description: string;
}

export const NAKATH_DATA: Nakath[] = [
  {
    id: "1",
    event: "නව සඳ බැලීම",
    time: "මාර්තු 19-20",
    color: "",
    description:
      "අලුත් අවුරුද්දේ නව සඳ බැලීම සිදු වේ. මෙය අලුත් අවුරුද්දේ ආරම්භය සලකුණු කරන සම්ප්‍රදායක ක්‍රියාවකි. අභිනව චන්ද්‍ර වර්ෂය සඳහා මාර්තු මස 20 වන සිකුරාදා දින ද, අභිතව සූර්ය වර්ෂය සඳහා අප්‍රේල් මස 19 වන ඉරිදාදිත ද තව සඳ බැලීම මැනව.",
  },
  {
    id: "2",
    event: "පරණ අවුරුද්ද සඳහා ස්නානය",
    time: "අප්‍රේල් 13",
    color: "",
    description:
      "මෙය නව වසරේදී ශුද්ධිය, යහපත සහ සාර්ථකත්වය සඳහා කළ සම්ප්‍රදායක චාරිත්‍රයකි. අප්‍රේල් මස 13 වැනි සදු දින දිවුල් පත් යුෂ මිශ්‍ර නානු ගා ස්නානය කොට ඉෂ්ට දේවතා අනුස්මරණයේ යෙදී වාසය මැනවී.",
  },
  {
    id: "3",
    event: "පුණ්‍ය කාලය",
    time: "අප්‍රේල් 14 - පෙ.ව. 3:08",
    color: "",
    description:
      "අප්‍රේල් මස 14 වැනි අගහරුවාදා පූර්ව භාග 03.08 සිට එදිනම අපර භාග 03.56 දක්වා පුණ්‍ය කාලය බැවින් අප්‍රේල් මස 14 වන අගහරුවාදා පූර්ව භාග 03.08 ට පළමුව ආහාර පාන ගෙන සියලු වැඩ අත්හැර ආගමික වතාවත් වල යෙදීම",
  },
  {
    id: "4",
    event: "අලුත් අවුරුදු උදාව",
    time: "අප්‍රේල් 14 - පෙ.ව. 9:32 ",
    color: "",
    description:
      "අප්‍රේල් මස 14 වැනි අඟහරුවාදා පූර්ව භාග 09.32 ට සිංහල අලූත් අවුරුද්ද උදාවෙයි. පවුලේ සියලුදෙනා එක්ව සුබ පැතුම් හුවමාරු කර ගනිමින් නව වසරට පිවිසෙයි.",
  },
  
  {
    id: "5",
    event: "ආහාර පිසීම",
    time: "අප්‍රේල් 14 - පෙ.ව. 10:41",
    color: "තද රතු",
    description:
      "නැකතට අනුව ලිප ගිනි දල්වා කිරිබත් හා රසකැවිලි සූදානම් කිරීම සිදු කරයි. අප්‍රේල් මස 14 වෙනි අගහරුවාදා පූර්ව භාග 10.41 ට රක්ත වර්ණ වස්ත්‍රාභරණයෙන් සැරසී දකුණු දිශාව බලා ලිප් බැද ගිණි මොලවා කිරි බතක්ද, කැවිලි වර්ගයක්ද, දී කිරි වලද ද, පිලියෙල කර ගැනීම මැනවි. මේ අවස්ථාව පවුල් එකමුතුව නිරූපණය කරයි.",
  },
  {
    id: "6",
    event: "ගණුදෙනු කිරීම සහ ආහාර අනුභවය",
    time: "අප්‍රේල් 14 - ප.ව. 12:05",
    color: "තද රතු",
    description:
      "අප්‍රේල් මස 14 වෙනි අඟහරුවාදා අපර භාග 12.05 ට රක්ත වර්ණ වස්ත්‍රාභරණයෙන් සැරසී දකුණු දිශාව බලා සියලු වැඩ අල්ලා ගමුදෙනු කොට ආහාර අනුභවය කිරීම මාතවි. නැකතට අනුව පළමුව වැඩ ආරම්භ කර පසුව ආහාර අනුභව කරයි. මෙය වසර පුරා සාර්ථකත්වයට ප්‍රාර්ථනා කරන සම්ප්‍රදායයකි.",
  },
  {
    id: "7",
    event: "හිසතෙල් ගෑම",
    time: "අප්‍රේල් 15 - පෙ.ව. 06:54",
    color: "තද කොළ",
    description:
      "අප්‍රේල් මස 15 වෙහි බදාදා පූර්ව භාග 06.54 ට නැගෙනහිර දිශාව බලා හිසට කොහොඹ පත්ද, පයට කොළොන් පද, තබා පච්ච වර්ගා වස්ත්‍රාභරණයෙන් සැරසී කොහොඹ පත් යුෂ මිශ්‍ර භානු හා තෙල් ගා ස්නානය කිරීම මැනවි. වඩාත් සුභ දිශාව බලා ඔසු සහිත තෙල් හිසට ගා ආශිර්වාද ලබා ගනී. මෙය සෞඛ්‍යය, ආරක්ෂාව සහ යහපත සඳහා කළ සම්ප්‍රදායක චාරිත්‍රයකි.",
  },
  {
    id: "8",
    event: "රැකී රක්ෂා සඳහා පිටත්ව යෑම",
    time: "අප්‍රේල් 20 - පෙ.ව. 6:27",
    color: "සුදු",
    description:
      "අප්‍රේල් මස 20 වැනි සඳුදා පූර්ව භාග 06.27 ට ශ්වේත වර්ණ වස්ත්‍රාභරණයෙන් සැරසී කිරිබත් සහ එළකිරි මිශ්‍ර කැවිලිද අනුභව කර දකුණු දිශාව බලා පිටත් වීම මැනවි.",
  },
  {
    id: "9",
    event: "පැළ සිටුවීම",
    time: "අප්‍රේල් 23 - පෙ.ව. 11:36",
    color: "තද කොළ",
    description:
      "අප්‍රේල් මස 23 වැනි බ්‍රහස්පතින්දා රන්වන් පැහැති වස්ත්‍රාභරණයෙන් සැරසී පූර්ව භාග 11.36 ට උතුරු දිශාව බලා පැළ සිටුවීම මැනවි. මෙය වසර පුරා සාර්ථකත්වයට ප්‍රාර්ථනා කරන සම්ප්‍රදායයකි.",
  },
];
